// BlueprintGeneratedClass BaseGunSkinVOComponent.BaseGunSkinVOComponent_C
// Size: 0x368 (Inherited: 0x178)
struct UBaseGunSkinVOComponent_C : UBaseVOComponent_C {
	struct TMap<enum class , struct UAkAudioEvent*> ; // 0x178(0x50)
	struct TMap<enum class , struct UAkAudioEvent*> ; // 0x1c8(0x50)
	struct TMap<enum class , struct UAkAudioEvent*> Kills; // 0x218(0x50)
	struct UAkAudioEvent* ; // 0x268(0x08)
	struct UAkAudioEvent* ; // 0x270(0x08)
	struct TMap<enum class , struct UAkAudioEvent*> ; // 0x278(0x50)
	struct TMap<enum class , struct UAkAudioEvent*> ; // 0x2c8(0x50)
	struct TMap<enum class , struct UAkAudioEvent*> ; // 0x318(0x50)

	void (struct TMap<enum class , struct UAkAudioEvent*>& , struct TMap<enum class , struct UAkAudioEvent*>& , struct TMap<enum class , struct UAkAudioEvent*>& ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct TMap<enum class , struct UAkAudioEvent*>& , struct TMap<enum class , struct UAkAudioEvent*>& , struct TMap<enum class , struct UAkAudioEvent*>& Kills); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (int32_t , struct UAudBasePawnVOComponent_C* VO Component); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* , bool ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
	void (struct UAudBasePawnVOComponent_C* ); // Function BaseGunSkinVOComponent.BaseGunSkinVOComponent_C. // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x33d1d60
};

