// BlueprintGeneratedClass BombGameMode.BombGameMode_C
// Size: 0xe64 (Inherited: 0xa88)
struct ABombGameMode_C : ABaseGameMode_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa88(0x08)
	struct UTimeGameStateComponent* GameStateTimeoutCountdown; // 0xa90(0x08)
	struct UComp_Actor_MultiTargetHandler_Buff_C* Comp_Actor_MultiTargetHandler_Buff_TimeoutFreeze; // 0xa98(0x08)
	struct UBaseGameStateComponent* GameStateTimeoutQueued; // 0xaa0(0x08)
	struct UTimeGameStateComponent* GameStateTimeout; // 0xaa8(0x08)
	struct UBaseGameStateComponent* GameStateTimeoutInactive; // 0xab0(0x08)
	struct UStateMachineComponent* TimeoutStateMachine; // 0xab8(0x08)
	struct UComp_MatchResults_StayedInSpawn_C* Comp_MatchResults_StayedInSpawn; // 0xac0(0x08)
	struct UComp_BombRoundStateLog_C* Comp_BombRoundStateLog; // 0xac8(0x08)
	struct UGameStateVoteComponent_C* GameStateVoteComponent; // 0xad0(0x08)
	struct UComp_GameMode_OvertimeDrawVotes_C* Comp_GameMode_OvertimeDrawVotes; // 0xad8(0x08)
	struct UComp_GameMode_GrantPurchasables_C* Comp_GameMode_GrantPurchasables; // 0xae0(0x08)
	struct UComp_MatchResults_RoundCeremony_C* Comp_MatchResults_RoundCeremony; // 0xae8(0x08)
	struct UComp_MatchResults_PlayerScores_C* Comp_MatchResults_PlayerScores; // 0xaf0(0x08)
	struct UComp_MatchResults_Penalites_C* Comp_MatchResults_Penalites; // 0xaf8(0x08)
	struct UComp_MatchResults_Kill_C* Comp_MatchResults_Kill; // 0xb00(0x08)
	struct UComp_MatchResults_Economy_C* Comp_MatchResults_Economy; // 0xb08(0x08)
	struct UComp_MatchResults_Damage_C* Comp_MatchResults_Damage; // 0xb10(0x08)
	struct UComp_MatchResults_Bomb_C* Comp_MatchResults_Bomb; // 0xb18(0x08)
	struct UComp_MatchResults_Abilities_C* Comp_MatchResults_Abilities; // 0xb20(0x08)
	struct UTimeGameStateComponent* GameStateBuyPhase; // 0xb28(0x08)
	struct UTimeGameStateComponent* GameStateBombPlanted; // 0xb30(0x08)
	struct UBaseGameStateComponent* GameStateTeamSwitch; // 0xb38(0x08)
	struct UTimeGameStateComponent* GameStatePostRound; // 0xb40(0x08)
	struct UTimeGameStateComponent* GameStateRound; // 0xb48(0x08)
	struct FTransform BombSpawnTransform; // 0xb50(0x30)
	struct APlantedBomb_C* BombPlantedObject; // 0xb80(0x08)
	float MatchTimerWarning; // 0xb88(0x04)
	bool HasPlayedMatchTimerWarning; // 0xb8c(0x01)
	char pad_B8D[0x3]; // 0xb8d(0x03)
	float BombPlantedMatchTimerWarning; // 0xb90(0x04)
	struct FAresGameRewardMultiplier BombPlantTeamMateMultiplier; // 0xb94(0x24)
	int32_t WinSpread; // 0xbb8(0x04)
	int32_t WinningDirection; // 0xbbc(0x04)
	struct TArray<float> CloseLossBonuses; // 0xbc0(0x10)
	struct UBaseTeamComponent* L_LosingTeam; // 0xbd0(0x08)
	float EscalatingMoney; // 0xbd8(0x04)
	float PerRoundEscalationMoney; // 0xbdc(0x04)
	struct FName L_RewardName; // 0xbe0(0x0c)
	float PerRoundEscalationEnergy; // 0xbec(0x04)
	float EscalatingEnergy; // 0xbf0(0x04)
	int32_t EscalatingWinEnergy; // 0xbf4(0x04)
	int32_t PerRoundWinEnergyEscalation; // 0xbf8(0x04)
	int32_t StartingEnergy; // 0xbfc(0x04)
	struct TArray<struct FRoundEndRewards> RoundEndRewards; // 0xc00(0x10)
	float KillMoneyEscalation; // 0xc10(0x04)
	char pad_C14[0x4]; // 0xc14(0x04)
	struct AActor* SensorTowerMarker; // 0xc18(0x08)
	int32_t UltimatePointsGrantedOnKill; // 0xc20(0x04)
	char pad_C24[0x4]; // 0xc24(0x04)
	struct TArray<struct AOwnerExclusivePlayerInfo*> RedPlayersWhoGotUltimate; // 0xc28(0x10)
	struct TArray<struct AOwnerExclusivePlayerInfo*> BluePlayersWhoGotUltimate; // 0xc38(0x10)
	int32_t UltimatePointsGrantedOnDeath; // 0xc48(0x04)
	int32_t DeadWinners; // 0xc4c(0x04)
	int32_t CloseLossKillBonus; // 0xc50(0x04)
	char pad_C54[0x4]; // 0xc54(0x04)
	struct TArray<struct FInsuranceRewards> InsuranceRewards; // 0xc58(0x10)
	struct FString Close Loss Reward Name; // 0xc68(0x10)
	int32_t ComputedUltimatePointsForKill; // 0xc78(0x04)
	char pad_C7C[0x4]; // 0xc7c(0x04)
	struct ABombDetonationActor_C* BombDetonationActor; // 0xc80(0x08)
	struct FMulticastInlineDelegate OnDefendersWipe; // 0xc88(0x10)
	struct FMulticastInlineDelegate OnAttackersWipe; // 0xc98(0x10)
	struct UAudBombGameModeVOComponent_C* AudBombGameModeVOComponent; // 0xca8(0x08)
	float InitialEquippableCooldownOnRoundStart; // 0xcb0(0x04)
	int32_t BombPlanterUltimatePointReward; // 0xcb4(0x04)
	int32_t BombDefuserUltimatePointReward; // 0xcb8(0x04)
	char pad_CBC[0x4]; // 0xcbc(0x04)
	struct FMulticastInlineDelegate AuthSideSwitchEvent; // 0xcc0(0x10)
	float New Time Out Time; // 0xcd0(0x04)
	bool IsFirstRoundOnSide; // 0xcd4(0x01)
	bool IsGameserverLoggingEnabled; // 0xcd5(0x01)
	char pad_CD6[0x2]; // 0xcd6(0x02)
	struct UBaseAudioComponent_C* Aud_BombGameMode; // 0xcd8(0x08)
	struct TArray<struct AGameObject*> BuyDomes; // 0xce0(0x10)
	struct ABaseCeremony_C* AceCeremony; // 0xcf0(0x08)
	struct TSoftClassPtr<UObject> BasePistolClass; // 0xcf8(0x30)
	struct TArray<struct AAresItem*> DroppedBasePistols; // 0xd28(0x10)
	int32_t MaxOnGroundBasePistols; // 0xd38(0x04)
	char pad_D3C[0x4]; // 0xd3c(0x04)
	struct FClassInclusionExclusionFilter DeletableOnGroundEquippable; // 0xd40(0x50)
	struct FMulticastInlineDelegate BuyPhaseStarted; // 0xd90(0x10)
	char DefaultTickRate; // 0xda0(0x01)
	char PreRoundTickRate; // 0xda1(0x01)
	bool IsRedTeamAllAFK; // 0xda2(0x01)
	bool IsBlueTeamAllAFK; // 0xda3(0x01)
	char pad_DA4[0x4]; // 0xda4(0x04)
	struct TArray<struct AShooterPlayerState*> LightArmorGrantsForDisconnects; // 0xda8(0x10)
	struct TMap<struct UBaseTeamComponent*, int32_t> UltOrbGrantsForDisconnects; // 0xdb8(0x50)
	bool HasPendingDisconnectGrants; // 0xe08(0x01)
	bool BombPlantPhaseStarted; // 0xe09(0x01)
	bool IsStoreEnabled; // 0xe0a(0x01)
	bool ShouldSpawnBomb; // 0xe0b(0x01)
	bool ShouldTrackPistolDropsForDeletion; // 0xe0c(0x01)
	char pad_E0D[0x3]; // 0xe0d(0x03)
	float MatchTimeoutQueued; // 0xe10(0x04)
	char pad_E14[0x4]; // 0xe14(0x04)
	struct UBaseTeamComponent* LastRoundWinningTeam; // 0xe18(0x08)
	struct ABombEquippable_C* BombEquippableActor; // 0xe20(0x08)
	struct FMulticastInlineDelegate InitializeTimeoutStateMachine; // 0xe28(0x10)
	struct FMulticastInlineDelegate QueueTimeout; // 0xe38(0x10)
	struct AShooterPlayerState* MatchTimeoutCallingPlayer; // 0xe48(0x08)
	struct FMulticastInlineDelegate CancelTimeout; // 0xe50(0x10)
	bool MatchTimeoutWasStoreEnabled; // 0xe60(0x01)
	bool NewVar_1; // 0xe61(0x01)
	bool SwitchingSide_VO; // 0xe62(0x01)
	bool MatchPoint_VO; // 0xe63(0x01)

	void BombDropped(struct AShooterCharacter* CharacterThatDroppedBomb); // Function BombGameMode.BombGameMode_C.BombDropped // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x3367a20
	void GetGameStatePostRound(struct UTimeGameStateComponent*& GameStatePostRound); // Function BombGameMode.BombGameMode_C.GetGameStatePostRound // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x3367a20
	void AuthCancelMatchTimeout(); // Function BombGameMode.BombGameMode_C.AuthCancelMatchTimeout // (BlueprintAuthorityOnly|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x3367a20
	void GetPreviousRoundWinner(struct UBaseTeamComponent*& WinningTeam); // Function BombGameMode.BombGameMode_C.GetPreviousRoundWinner // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x3367a20
