// BlueprintGeneratedClass BombGameMode.BombGameMode_C
// Size: 0xe74 (Inherited: 0xa90)
struct ABombGameMode_C : ABaseGameMode_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xa90(0x08)
	struct UTimeGameStateComponent* GameStateTimeoutCountdown; // 0xa98(0x08)
	struct UComp_Actor_MultiTargetHandler_Buff_C* Comp_Actor_MultiTargetHandler_Buff_TimeoutFreeze; // 0xaa0(0x08)
	struct UBaseGameStateComponent* GameStateTimeoutQueued; // 0xaa8(0x08)
	struct UTimeGameStateComponent* GameStateTimeout; // 0xab0(0x08)
	struct UBaseGameStateComponent* GameStateTimeoutInactive; // 0xab8(0x08)
	struct UStateMachineComponent* TimeoutStateMachine; // 0xac0(0x08)
	struct UComp_MatchResults_StayedInSpawn_C* Comp_MatchResults_StayedInSpawn; // 0xac8(0x08)
	struct UComp_BombRoundStateLog_C* Comp_BombRoundStateLog; // 0xad0(0x08)
	struct UGameStateVoteComponent_C* GameStateVoteComponent; // 0xad8(0x08)
	struct UComp_GameMode_OvertimeDrawVotes_C* Comp_GameMode_OvertimeDrawVotes; // 0xae0(0x08)
	struct UComp_GameMode_GrantPurchasables_C* Comp_GameMode_GrantPurchasables; // 0xae8(0x08)
	struct UComp_MatchResults_RoundCeremony_C* Comp_MatchResults_RoundCeremony; // 0xaf0(0x08)
	struct UComp_MatchResults_PlayerScores_C* Comp_MatchResults_PlayerScores; // 0xaf8(0x08)
	struct UComp_MatchResults_Penalites_C* Comp_MatchResults_Penalites; // 0xb00(0x08)
	struct UComp_MatchResults_Kill_C* Comp_MatchResults_Kill; // 0xb08(0x08)
	struct UComp_MatchResults_Economy_C* Comp_MatchResults_Economy; // 0xb10(0x08)
	struct UComp_MatchResults_Damage_C* Comp_MatchResults_Damage; // 0xb18(0x08)
	struct UComp_MatchResults_Bomb_C* Comp_MatchResults_Bomb; // 0xb20(0x08)
	struct UComp_MatchResults_Abilities_C* Comp_MatchResults_Abilities; // 0xb28(0x08)
	struct UTimeGameStateComponent* GameStateBuyPhase; // 0xb30(0x08)
	struct UTimeGameStateComponent* GameStateBombPlanted; // 0xb38(0x08)
	struct UBaseGameStateComponent* GameStateTeamSwitch; // 0xb40(0x08)
	struct UTimeGameStateComponent* GameStatePostRound; // 0xb48(0x08)
	struct UTimeGameStateComponent* GameStateRound; // 0xb50(0x08)
	char pad_B58[0x8]; // 0xb58(0x08)
	struct FTransform BombSpawnTransform; // 0xb60(0x30)
	struct APlantedBomb_C* BombPlantedObject; // 0xb90(0x08)
	float MatchTimerWarning; // 0xb98(0x04)
	bool HasPlayedMatchTimerWarning; // 0xb9c(0x01)
	char pad_B9D[0x3]; // 0xb9d(0x03)
	float BombPlantedMatchTimerWarning; // 0xba0(0x04)
	struct FAresGameRewardMultiplier BombPlantTeamMateMultiplier; // 0xba4(0x24)
	int32_t WinSpread; // 0xbc8(0x04)
	int32_t WinningDirection; // 0xbcc(0x04)
	struct TArray<float> CloseLossBonuses; // 0xbd0(0x10)
	struct UBaseTeamComponent* L_LosingTeam; // 0xbe0(0x08)
	float EscalatingMoney; // 0xbe8(0x04)
	float PerRoundEscalationMoney; // 0xbec(0x04)
	struct FName L_RewardName; // 0xbf0(0x0c)
	float PerRoundEscalationEnergy; // 0xbfc(0x04)
	float EscalatingEnergy; // 0xc00(0x04)
	int32_t EscalatingWinEnergy; // 0xc04(0x04)
	int32_t PerRoundWinEnergyEscalation; // 0xc08(0x04)
	int32_t StartingEnergy; // 0xc0c(0x04)
	struct TArray<struct FRoundEndRewards> RoundEndRewards; // 0xc10(0x10)
	float KillMoneyEscalation; // 0xc20(0x04)
	char pad_C24[0x4]; // 0xc24(0x04)
	struct AActor* SensorTowerMarker; // 0xc28(0x08)
	int32_t UltimatePointsGrantedOnKill; // 0xc30(0x04)
	char pad_C34[0x4]; // 0xc34(0x04)
	struct TArray<struct AOwnerExclusivePlayerInfo*> RedPlayersWhoGotUltimate; // 0xc38(0x10)
	struct TArray<struct AOwnerExclusivePlayerInfo*> BluePlayersWhoGotUltimate; // 0xc48(0x10)
	int32_t UltimatePointsGrantedOnDeath; // 0xc58(0x04)
	int32_t DeadWinners; // 0xc5c(0x04)
	int32_t CloseLossKillBonus; // 0xc60(0x04)
	char pad_C64[0x4]; // 0xc64(0x04)
	struct TArray<struct FInsuranceRewards> InsuranceRewards; // 0xc68(0x10)
	struct FString Close Loss Reward Name; // 0xc78(0x10)
	int32_t ComputedUltimatePointsForKill; // 0xc88(0x04)
	char pad_C8C[0x4]; // 0xc8c(0x04)
	struct ABombDetonationActor_C* BombDetonationActor; // 0xc90(0x08)
	struct FMulticastInlineDelegate OnDefendersWipe; // 0xc98(0x10)
	struct FMulticastInlineDelegate OnAttackersWipe; // 0xca8(0x10)
	struct UAudBombGameModeVOComponent_C* AudBombGameModeVOComponent; // 0xcb8(0x08)
	float InitialEquippableCooldownOnRoundStart; // 0xcc0(0x04)
	int32_t BombPlanterUltimatePointReward; // 0xcc4(0x04)
	int32_t BombDefuserUltimatePointReward; // 0xcc8(0x04)
	char pad_CCC[0x4]; // 0xccc(0x04)
	struct FMulticastInlineDelegate AuthSideSwitchEvent; // 0xcd0(0x10)
	float New Time Out Time; // 0xce0(0x04)
	bool IsFirstRoundOnSide; // 0xce4(0x01)
	bool IsGameserverLoggingEnabled; // 0xce5(0x01)
	char pad_CE6[0x2]; // 0xce6(0x02)
	struct UBaseAudioComponent_C* Aud_BombGameMode; // 0xce8(0x08)
	struct TArray<struct AGameObject*> BuyDomes; // 0xcf0(0x10)
	struct ABaseCeremony_C* AceCeremony; // 0xd00(0x08)
	struct TSoftClassPtr<UObject> BasePistolClass; // 0xd08(0x30)
	struct TArray<struct AAresItem*> DroppedBasePistols; // 0xd38(0x10)
	int32_t MaxOnGroundBasePistols; // 0xd48(0x04)
	char pad_D4C[0x4]; // 0xd4c(0x04)
	struct FClassInclusionExclusionFilter DeletableOnGroundEquippable; // 0xd50(0x50)
	struct FMulticastInlineDelegate BuyPhaseStarted; // 0xda0(0x10)
	char DefaultTickRate; // 0xdb0(0x01)
	char PreRoundTickRate; // 0xdb1(0x01)
	bool IsRedTeamAllAFK; // 0xdb2(0x01)
	bool IsBlueTeamAllAFK; // 0xdb3(0x01)
	char pad_DB4[0x4]; // 0xdb4(0x04)
	struct TArray<struct AShooterPlayerState*> LightArmorGrantsForDisconnects; // 0xdb8(0x10)
	struct TMap<struct UBaseTeamComponent*, int32_t> UltOrbGrantsForDisconnects; // 0xdc8(0x50)
	bool HasPendingDisconnectGrants; // 0xe18(0x01)
	bool BombPlantPhaseStarted; // 0xe19(0x01)
	bool IsStoreEnabled; // 0xe1a(0x01)
	bool ShouldSpawnBomb; // 0xe1b(0x01)
	bool ShouldTrackPistolDropsForDeletion; // 0xe1c(0x01)
	char pad_E1D[0x3]; // 0xe1d(0x03)
	float MatchTimeoutQueued; // 0xe20(0x04)
	char pad_E24[0x4]; // 0xe24(0x04)
	struct UBaseTeamComponent* LastRoundWinningTeam; // 0xe28(0x08)
	struct ABombEquippable_C* BombEquippableActor; // 0xe30(0x08)
	struct FMulticastInlineDelegate InitializeTimeoutStateMachine; // 0xe38(0x10)
	struct FMulticastInlineDelegate QueueTimeout; // 0xe48(0x10)
	struct AShooterPlayerState* MatchTimeoutCallingPlayer; // 0xe58(0x08)
	struct FMulticastInlineDelegate CancelTimeout; // 0xe60(0x10)
	bool MatchTimeoutWasStoreEnabled; // 0xe70(0x01)
	bool NewVar_1; // 0xe71(0x01)
	bool SwitchingSide_VO; // 0xe72(0x01)
	bool MatchPoint_VO; // 0xe73(0x01)

	void BombDropped(struct AShooterCharacter* CharacterThatDroppedBomb); // Function BombGameMode.BombGameMode_C.BombDropped // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x337bc90
	void GetGameStatePostRound(struct UTimeGameStateComponent*& GameStatePostRound); // Function BombGameMode.BombGameMode_C.GetGameStatePostRound // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x337bc90
	void AuthCancelMatchTimeout(); // Function BombGameMode.BombGameMode_C.AuthCancelMatchTimeout // (BlueprintAuthorityOnly|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x337bc90
	void GetPreviousRoundWinner(struct UBaseTeamComponent*& WinningTeam); // Function BombGameMode.BombGameMode_C.GetPreviousRoundWinner // (Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x337bc90
